; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;; Reference paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;;                  Journal of Artificial Intelligence Research 68 (2020): 691-752.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; The Farmland domain models allocating manpower to farms, with a 
;; hard constraint on a metric measuring benefit. The contribution of
;; each farm to the benefit is a function of the number of workers assigned
;; Each farm requires at least one worker
(define (domain farmland)
    (:types farm - object)
    (:predicates (adj ?f1 ?f2 - farm))
    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 ?f2 - farm)
       :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 4) (adj ?f1 ?f2) )
      :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )
    
    (:action move-slow
         :parameters (?f1 ?f2 - farm)
         :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 1) (adj ?f1 ?f2))
         :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_15)
	(:domain farmland)
	(:objects
		farm0  farm1  farm2  farm3  farm4  farm5  farm6  - farm
	)
  (:init
        (= (cost) 0)
		(= (x farm0) 0)
		(= (x farm1) 1)
		(= (x farm2) 15)
		(= (x farm3) 0)
		(= (x farm4) 1)
		(= (x farm5) 1)
		(= (x farm6) 0)
		
		(adj farm0 farm1)
		(adj farm0 farm2)
		(adj farm0 farm3)
		(adj farm0 farm4)
		(adj farm0 farm5)
		(adj farm0 farm6)
		(adj farm1 farm0)
		(adj farm2 farm0)
		(adj farm3 farm0)
		(adj farm4 farm0)
		(adj farm5 farm0)
		(adj farm6 farm0)
		
	)
	(:goal
		(and
			(>= (x farm0) 1)
			(>= (x farm1) 1)
			(>= (x farm2) 1)
			(>= (x farm3) 1)
			(>= (x farm4) 1)
			(>= (x farm5) 1)
			(>= (x farm6) 1)
			
			(>= (+ (* 1.3 (x farm0))(+ (* 1.8 (x farm1))(+ (* 1.0 (x farm2))(+ (* 1.2 (x farm3))(+ (* 1.9 (x farm4))(+ (* 1.9 (x farm5))(+ (* 1.4 (x farm6)) 0))))))) 21.0)
		)
	)
)

; plan
1. (move-slow farm2 farm0)
   changed: (x farm2) from 15 to 14, (x farm0) from 0 to 1
   goals met: 5 of 8
2. (move-slow farm0 farm6)
   changed: (x farm0) from 1 to 0, (x farm6) from 0 to 1
   goals met: 6 of 8
3. (move-slow farm2 farm0)
   changed: (x farm2) from 14 to 13, (x farm0) from 0 to 1
   goals met: 7 of 8
4. (move-slow farm0 farm3)
   changed: (x farm0) from 1 to 0, (x farm3) from 0 to 1
   goals met: 7 of 8
5. (move-slow farm2 farm0)
   changed: (x farm2) from 13 to 12, (x farm0) from 0 to 1
   goals met: 8 of 8
